toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
#include "System.h"
#include "Assert.h"
#include "SystemClock.h"
#include "Startup.h"
#include "MSP430.h"

using EchoMsg = ICE40::EchoMsg;
using EchoResp = ICE40::EchoResp;
using LEDSetMsg = ICE40::LEDSetMsg;
using SDInitMsg = ICE40::SDInitMsg;
using SDSendCmdMsg = ICE40::SDSendCmdMsg;
using SDStatusMsg = ICE40::SDStatusMsg;
using SDStatusResp = ICE40::SDStatusResp;
using SDReadoutMsg = ICE40::SDReadoutMsg;
using ImgResetMsg = ICE40::ImgResetMsg;
using ImgSetHeader1Msg = ICE40::ImgSetHeader1Msg;
using ImgSetHeader2Msg = ICE40::ImgSetHeader2Msg;
using ImgCaptureMsg = ICE40::ImgCaptureMsg;
using ImgReadoutMsg = ICE40::ImgReadoutMsg;
using ImgI2CTransactionMsg = ICE40::ImgI2CTransactionMsg;
using ImgI2CStatusMsg = ICE40::ImgI2CStatusMsg;
using ImgI2CStatusResp = ICE40::ImgI2CStatusResp;
using ImgCaptureStatusMsg = ICE40::ImgCaptureStatusMsg;
using ImgCaptureStatusResp = ICE40::ImgCaptureStatusResp;

using SDRespTypes = ICE40::SDSendCmdMsg::RespTypes;
using SDDatInTypes = ICE40::SDSendCmdMsg::DatInTypes;

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
static uint8_t _buf0[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));
static uint8_t _buf1[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));

using namespace STApp;

System::System() :
// QSPI clock divider=1 => run QSPI clock at 64 MHz
// QSPI alignment=word for high performance transfers
_usbTask([&] { _usb_task(); }),
_qspi(QSPI::Mode::Dual, 1, QSPI::Align::Word, QSPI::ChipSelect::Uncontrolled),
_bufs(_buf0, _buf1),
_sd({ .task = Task([&] { _sd_task(); }) }) {
}

void System::init() {
    _super::init();
    _usb.init();
    _qspi.init();
    
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
    _ICE_ST_SPI_CS_::Write(1);
    
    _ice_init();
    _msp_init();
    _sd_init();
}

void System::run() {
    Task::Run(_usbTask, _sd.task);
}

//void System::_handleEvent() {
//    // Wait for an event to occur on one of our channels
//    ChannelSelect::Start();
//    if (auto x = _usb.cmdRecvChannel.readSelect()) {
//        _usb_handleCmd(*x);
//    
//    } else if (auto x = _usb.sendDoneChannel(Endpoints::DataIn).readSelect()) {
//        _usb_sendReady(*x);
//    
//    } else if (auto x = _qspi.eventChannel.readSelect()) {
//        _sdRead_qspiEventHandle(*x);
//    
//    } else {
//        // No events, go to sleep
//        ChannelSelect::Wait();
//    }
//    ChannelSelect::End();
//}
//
//void System::_reset(const Cmd& cmd) {
//    _op = Op::None;
//    _usb.reset(Endpoints::DataIn);
//    _usb_finishCmd(true);
//}

#pragma mark - USB

void System::_usb_task() {
    TaskBegin();
    for (;;) {
        TaskWait(_usb.cmdRecvChannel.readable());
        
        auto ev = _usb.cmdRecvChannel.read();
        Cmd cmd;
        
        // Validate command length
        if (ev.len != sizeof(cmd)) {
            _usb_finishCmd(false);
            continue;
        }
        
        memcpy(&cmd, ev.data, ev.len);
        
        switch (cmd.op) {
        
        case Op::SDRead:
            _sd.task.reset();
            _sd.trigger.reset();
            _sd.trigger.write(cmd);
            break;
        
        case Op::LEDSet:
            _ledSet(cmd);
            break;
        
        // Bad command
        default:
            _usb_finishCmd(false);
            break;
        }
    }
    TaskEnd();
}

void System::_usb_sendFromBuf() {
    Assert(!_bufs.empty());
    Assert(_usb.sendReady(Endpoints::DataIn));
    
    const auto& buf = _bufs.front();
    _usb.send(Endpoints::DataIn, buf.data, buf.len);
}

//void System::_usb_sendReady(const USB::Event& ev) {
//    switch (_op) {
//    case Op::SDRead:    _sdRead_usbSendReady(ev);   break;
//    default:                                        break;
//    }
//}

void System::_usb_finishCmd(bool status) {
    // Send our response
    _usb.cmdSendStatus(status);
}

#pragma mark - ICE40

static QSPI_CommandTypeDef _ice_qspiCmd(const ICE40::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
    // When dual-flash quadspi is enabled, the supplied address is
    // divided by 2, so we left-shift `addr` in anticipation of that.
    // By doing so, we throw out the high bit of `msg`, however we
    // wrote the ICE40 Verilog to fake the first bit as 1, so verify
    // that the first bit is indeed 1.
    AssertArg(b[0] & 0x80);
    
    return QSPI_CommandTypeDef{
        // Use instruction stage to introduce 2 dummy cycles, to workaround an
        // apparent STM32 bug that always sends the first nibble as 0xF.
        .Instruction = 0x00,
        .InstructionMode = QSPI_INSTRUCTION_4_LINES,
        
        // When dual-flash quadspi is enabled, the supplied address is
        // divided by 2, so we left-shift `addr` in anticipation of that.
        .Address = (
            (uint32_t)b[0]<<24  |
            (uint32_t)b[1]<<16  |
            (uint32_t)b[2]<<8   |
            (uint32_t)b[3]<<0
        ) << 1,
//            .Address = 0,
        .AddressSize = QSPI_ADDRESS_32_BITS,
        .AddressMode = QSPI_ADDRESS_4_LINES,
        
        .AlternateBytes = (
            (uint32_t)b[4]<<24  |
            (uint32_t)b[5]<<16  |
            (uint32_t)b[6]<<8   |
            (uint32_t)b[7]<<0
        ),
//            .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_32_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_4_LINES,
        
        .DummyCycles = 4,
        
        .NbData = (uint32_t)respLen,
        .DataMode = (respLen ? QSPI_DATA_4_LINES : QSPI_DATA_NONE),
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

void System::_ice_init() {
    // Confirm that we can communicate with the ICE40.
    // Interrupts need to be enabled for this, since _ice_transfer()
    // waits for a response on qspi.eventChannel.
    EchoResp resp;
    const char str[] = "halla";
    _ice_transfer(EchoMsg(str), resp);
    Assert(!strcmp((char*)resp.payload, str));
}

