toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
void System::_sd_task() {
    TaskBegin();
    for (;;) {
        // Wait for an SDRead command
        TaskWait(_sd.trigger.readable());
        const Cmd cmd = _sd.trigger.read();
        
        // Stop reading from the SD card if a read is currently underway
        _sd_stopReading();
        
        // Reset the data channel (which sends a 2xZLP+sentinel sequence)
        _usb.reset(Endpoints::DataIn);
        // Wait until we're done resetting the DataIn endpoint
        TaskWait(_usb.sendReady(Endpoints::DataIn));
        
        // ====================
        // CMD18 | READ_MULTIPLE_BLOCK
        //   State: Transfer -> Send Data
        //   Read blocks of data (1 block == 512 bytes)
        // ====================
        {
            auto status = _sd_sendCmd(SDSendCmdMsg::CMD18, cmd.arg.SDRead.addr, SDRespTypes::Len48, SDDatInTypes::Len4096xN);
            Assert(!status.respCRCErr());
        }
        
        // Send the SDReadout message, which causes us to enter the SD-readout mode until
        // we release the chip select
        _ICE_ST_SPI_CS_::Write(0);
        _ice_transferNoCS(SDReadoutMsg());
        
        // Let the host know that the USB command was successful
        _usb_finishCmd(true);
        
        // Indefinitely read data over QSPI and write it to USB
        for (;;) {
            for (;;) {
                bool didWork = false;
                // Read data into the producer buffer when:
                //   - there's space in the queue, and
                //   - QSPI is ready to accept commands
                if (!_bufs.full() && _qspi.ready()) {
                    _sd_readToBuf();
                    didWork = true;
                }
                
                // Send data from the consumer buffer when:
                //   - we have data to write, and
                //   - the DataIn USB endpoint is ready to accept data
                if (!_bufs.empty() && _usb.sendReady(Endpoints::DataIn)) {
                    _usb_sendFromBuf();
                    didWork = true;
                }
                
                if (!didWork) break;
            }
            
            TaskYield();
        }
    }
    TaskEnd();
}

void System::_sd_readToBuf() {
    Assert(!_bufs.full());
    Assert(_qspi.ready());
    
    auto& buf = _bufs.back();
    
    // Wait for ICE40 to signal that data is ready
    while (!_ICE_ST_SPI_D_READY::Read());
    
    // TODO: how do we handle lengths that aren't a multiple of ReadoutLen?
    const size_t len = SDReadoutMsg::ReadoutLen;
    QSPI_CommandTypeDef qspiCmd = {
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        .AddressMode = QSPI_ADDRESS_NONE,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        .DummyCycles = 8,
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_4_LINES,
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
    
    _qspi.read(qspiCmd, buf.data+buf.len, len);
    buf.len += len;
}

void System::_sd_readToBufSync(void* buf, size_t len) {
    // Assert chip-select so that we stay in the readout state until we release it
    _ICE_ST_SPI_CS_::Write(0);
    
    // Send the SDReadout message, which causes us to enter the SD-readout mode until
    // we release the chip select
    _ice_transferNoCS(SDReadoutMsg());
    
    // TODO: how do we handle lengths that aren't a multiple of ReadoutLen?
    QSPI_CommandTypeDef qspiCmd = {
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        .AddressMode = QSPI_ADDRESS_NONE,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        .DummyCycles = 8,
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_4_LINES,
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
    
    _qspi.read(qspiCmd, buf, len);
    _qspi.eventChannel.read(); // Wait for the transfer to complete
    
    _ICE_ST_SPI_CS_::Write(1);
}

//void System::_sdRead_qspiEventHandle(const QSPI::Event& ev) {
//    Assert(_op == Op::SDRead);
//    
//    auto& buf = _bufs.back();
//    
//    // If we can't read any more data into the producer buffer,
//    // push it so the data will be sent over USB
//    if (buf.cap-buf.len < SDReadoutMsg::ReadoutLen) {
//        _opDataRem -= buf.len;
//        _bufs.push();
//    }
//    
//    // Advance state machine
//    _sdRead_updateState();
//}

//void System::_sdRead_usbSendReady(const USB::Event& ev) {
//    Assert(_op == Op::SDRead);
//    // Advance state machine
//    _sdRead_updateState();
//}

//void System::_sdRead_updateState() {
//    // Read data into the producer buffer when:
//    //   - there's more data to be read, and
//    //   - there's space in the queue, and
//    //   - QSPI is ready to accept commands
//    if (_opDataRem && !_bufs.full() && _qspi.ready()) {
//        _sd_readToBuf();
//    }
//    
//    // Send data from the consumer buffer when:
//    //   - we have data to write, and
//    //   - the DataIn USB endpoint is ready to accept data
//    if (!_bufs.empty() && _usb.sendReady(Endpoints::DataIn)) {
//        _usb_sendFromBuf();
//    }
//    
//    // We're done when:
//    //   - there's no more data to be read, and
//    //   - there's no more data to send over USB
//    if (!_opDataRem && _bufs.empty()) {
//        _sdRead_stop();
//    }
//}

void System::_sd_stopReading() {
    if (_sd.reading) {
        _ICE_ST_SPI_CS_::Write(1);
        
        // ====================
        // CMD12 | STOP_TRANSMISSION
        //   State: Send Data -> Transfer
        //   Finish reading
        // ====================
        {
            auto status = _sd_sendCmd(SDSendCmdMsg::CMD12, 0);
            Assert(!status.respCRCErr());
        }
        
        _sd.reading = false;
    }
}

#pragma mark - Other Commands

void System::_ledSet(const Cmd& cmd) {
    switch (cmd.arg.LEDSet.idx) {
    case 0: _usb_finishCmd(false); return;
    case 1: _LED1::Write(cmd.arg.LEDSet.on); break;
    case 2: _LED2::Write(cmd.arg.LEDSet.on); break;
    case 3: _LED3::Write(cmd.arg.LEDSet.on); break;
    }
    
    _usb_finishCmd(true);
}

System Sys;

bool IRQState::SetInterruptsEnabled(bool en) {
    const bool prevEn = !__get_PRIMASK();
    if (en) __enable_irq();
    else __disable_irq();
    return prevEn;
}

void IRQState::WaitForInterrupt() {
    __WFI();
}

int main() {
    Sys.init();
    Sys.run();
    return 0;
}

[[noreturn]] void abort() {
    Sys.abort();
}
